{"tree_id": "5587", "first_story_block": "Hello, adventurer! It seems that some random village has been beset by that big ol' beastie pictured over there.  Cute, isn't he?\n\nOf course, being the hero that you are, it's obviously your duty to fight it. So, what are you waiting for?\n\nFirst off, you'll have to select your job. Your job affects what abilities you have.\n\n \n \n \n \n ", "action_results": [{"action": "Warrior (Physical attacker)", "result": "Excellent choice!\n\nYou charge off to beat up the Behemoth...", "action_results": [{"action": "Begin the fight!", "result": "Sword in hand, you stand in a ready stance. The Behemoth growls.", "action_results": [null, {"action": "Slash it with your sword!", "result": "You attack the Behemoth.\n\nIt swings a massive claw at you. Ouch.", "action_results": [null]}, {"action": "Dual Strike (uses 1 mana, higher capacity for damage)", "result": "You leap forward, slashing twice at the Behemoth.\n\nThe Behemoth counters with a mighty blow.", "action_results": [null]}]}, {"action": "Explanations of the variables", "result": "Your health is... well... how much health you have. If it drops below zero, it's game over. Don't worry, it's not going to stay at 1. Since different jobs will have different amounts of health, you'll get the rest of your health after you click the link to begin the fight.\n\nThe variable entitled Behemoth is how much health your foe has. You want this to drop to zero.\n\nMana is required to use certain skills. Once it drops to zero... well, it's not game over, but you won't be able to use some skills. Once again, you'll get the rest of your mana after you begin the fight.\n\nYour Drivemeter will raise as you perform actions. Once it reaches ten, you will be able to perform an Overdrive attack. The Overdrive varies with each job.\n\n \n ", "action_results": [null]}]}, {"action": "Wizard (Can use magic)", "result": "Excellent choice!\n\nYou charge off to zap, burninate or freeze the Behemoth (depending on your mood)...", "action_results": [{"action": "Fight on, Wizard!", "result": "Staff in hand, you stand in a ready stance. The Behemoth snarls.", "action_results": [null, null, {"action": "Cast Fire (takes 2 mana)", "result": "You cast Fire at the Behemoth.\n\nIt responds with Thunder.", "action_results": [null]}, {"action": "Cast Thunder (takes 2 mana)", "result": "You cast Thunder.\n\nUnfortunately, this Behemoth absorbs lightning. So, basically, you've just healed him.\n\nIt grins infuriatingly at you.", "action_results": [null]}, {"action": "Cast Blizzard (takes 2 mana)", "result": "You cast Blizzard.\n\nShivering, the Behemoth counters with Thunder.", "action_results": [null]}, {"action": "Cast Cure (takes 3 mana)", "result": "You cast Cure, and restore some of your health.", "action_results": [null]}]}, null]}, {"action": "Thief (Can steal stuff)", "result": "Excellent choice!\n\nYou charge off to beat up the Behemoth...\n\nbut not before snatching these items.", "action_results": [null, null, null, {"action": "Fight on, Thief!", "result": "You stand, daggers at the ready. The Behemoth bares its teeth at you.", "action_results": [null, {"action": "Scan (uses 1 mana point)", "result": "You examine the Behemoth closely... very closely.\n\nYou determine that you have approximately a 1 in 3 chance of successfully stealing an item from it, and that using a lightning-based attack will simply heal the monster.\n\nYou also determine that the Behemoth is allergic to Scan by experience when it lets out a mighty sneeze in your direction. Although it doesn't do that much damage, it's still pretty annoying.", "action_results": [null]}, {"action": "Steal", "result": "You attempt to steal from the Behemoth...", "action_results": [{"action": "Were you successful?", "result": "Your attempt is unsuccessful.\n\nThe Behemoth, a wee bit irked at you, casts Thunder.", "action_results": [null]}]}]}, null]}]}